package com.charamidis.lostAndFound.forms;

import javafx.stage.*;
import javafx.scene.*;
import javafx.scene.layout.*;
import javafx.scene.control.*;
import javafx.geometry.*;

public class AboutForm {

    TextArea txtArea;
    Button btnClose;
    Scene scene;
    Stage stage;
    VBox vBox ;

    public AboutForm(){
         txtArea = new TextArea("Σχετικά με εμάς\n" +
                 "Καλώς ήρθατε στο Σύστημα Διαχείρισης Απολεσθέντων Αντικειμένων Αεροδρομίου\n" +
                 "\n" +
                 "Το Σύστημα Διαχείρισης Απολεσθέντων Αντικειμένων Αεροδρομίου μας έχει σχεδιαστεί για να απλοποιεί και να διευκολύνει τη διαδικασία διαχείρισης απολεσθέντων αντικειμένων στο αεροδρόμιο. Είμαστε αφοσιωμένοι στο να βοηθάμε τους ταξιδιώτες να ανακτούν τα χαμένα αντικείμενά τους γρήγορα και αποτελεσματικά. Εδώ είναι μια λεπτομερής επισκόπηση των δυνατοτήτων της εφαρμογής μας:\n" +
                 "\n" +
                 "Χαρακτηριστικά\n" +
                 "Ασφαλής και Αξιόπιστη Διαχείριση Δεδομένων\n" +
                 "\n" +
                 "Μοναδική Αναγνώριση: Κάθε καταχώρηση χαμένου αντικειμένου λαμβάνει ένα μοναδικό ID για εύκολη παρακολούθηση και ανάκτηση.\n" +
                 "Αυτόματη Χρονοσφραγίδα: Οι καταχωρήσεις χρονοσφραγίζονται αυτόματα με την ημερομηνία και ώρα δημιουργίας για τη διατήρηση ακριβών αρχείων.\n" +
                 "Ολοκληρωμένη Καταγραφή\n" +
                 "\n" +
                 "Λεπτομερείς Περιγραφές Αντικειμένων: Αποθηκεύουμε λεπτομερείς περιγραφές χαμένων αντικειμένων, έως και 1000 χαρακτήρες, για να διασφαλίσουμε ότι κάθε πτυχή του αντικειμένου είναι τεκμηριωμένη.\n" +
                 "Πληροφορίες Βρέτη: Πληροφορίες για το άτομο που βρήκε το αντικείμενο, συμπεριλαμβανομένου του επωνύμου, ονόματος, αριθμού ταυτότητας, τηλεφώνου, διεύθυνσης, αριθμού οδού, ονόματος πατρός και περιοχής κατοικίας, αποθηκεύονται με ασφάλεια.\n" +
                 "Ημερομηνία και Τοποθεσία: Καταγράφουμε την ημερομηνία και ώρα που βρέθηκε το αντικείμενο και την συγκεκριμένη τοποθεσία στο αεροδρόμιο.\n" +
                 "Ταυτοποίηση Χρηστών και Ασφάλεια\n" +
                 "\n" +
                 "Επαλήθευση Υπαλλήλου: Κάθε καταχώρηση συνδέεται με τον υπάλληλο (αναγνωρισμένο από ένα μοναδικό ID υπαλλήλου) που την δημιούργησε, διασφαλίζοντας την υπευθυνότητα και ανιχνευσιμότητα.\n" +
                 "Ασφαλής Διαχείριση Κωδικών: Χρησιμοποιούμε προηγμένες τεχνικές κρυπτογράφησης κωδικών για να διασφαλίσουμε ότι τα στοιχεία των χρηστών αποθηκεύονται με ασφάλεια.\n" +
                 "Αποτελεσματική Αναζήτηση και Αναφορές\n" +
                 "\n" +
                 "Λειτουργία Αναζήτησης: Οι χρήστες μπορούν να αναζητούν χαμένα αντικείμενα χρησιμοποιώντας διάφορες παραμέτρους, συμπεριλαμβανομένων των περιγραφών των αντικειμένων, της ημερομηνίας, της τοποθεσίας και των λεπτομερειών του βρέτη.\n" +
                 "Εργαλεία Αναφορών: Δημιουργία λεπτομερών αναφορών για τα χαμένα και βρεθέντα αντικείμενα, βοηθώντας τις αρχές του αεροδρομίου να διαχειρίζονται και να αναλύουν τα δεδομένα αποτελεσματικά.\n" +
                 "Πώς Λειτουργεί\n" +
                 "Καταχώρηση Βρεθέντος Αντικειμένου\n" +
                 "\n" +
                 "Δημιουργία Καταχώρησης: Ένας υπάλληλος του αεροδρομίου συνδέεται στο σύστημα χρησιμοποιώντας ασφαλή διαπιστευτήρια.\n" +
                 "Εισαγωγή Λεπτομερειών: Ο υπάλληλος συμπληρώνει μια φόρμα με λεπτομερείς πληροφορίες για το βρεθέν αντικείμενο και το άτομο που το βρήκε.\n" +
                 "Αποθήκευση Δεδομένων: Το σύστημα αναθέτει αυτόματα ένα μοναδικό ID στην καταχώρηση και την αποθηκεύει με ασφάλεια στη βάση δεδομένων.\n" +
                 "Ανάκτηση Χαμένου Αντικειμένου\n" +
                 "\n" +
                 "Αναζήτηση: Οι χρήστες μπορούν να αναζητήσουν τα χαμένα αντικείμενά τους εισάγοντας σχετικές λεπτομέρειες στη φόρμα αναζήτησης.\n" +
                 "Ταίριασμα Καταχωρήσεων: Το σύστημα εμφανίζει καταχωρήσεις που ταιριάζουν με τα κριτήρια αναζήτησης.\n" +
                 "Διαδικασία Αξίωσης: Εάν βρεθεί ένα αντίστοιχο αντικείμενο, οι χρήστες μπορούν να επικοινωνήσουν με το γραφείο απολεσθέντων για να ξεκινήσουν τη διαδικασία αξίωσης.\n" +
                 "Ασφάλεια και Απόρρητο\n" +
                 "Δίνουμε μεγάλη σημασία στην ασφάλεια και το απόρρητο των χρηστών μας. Όλες οι προσωπικές πληροφορίες και οι λεπτομέρειες των αντικειμένων αποθηκεύονται με ασφάλεια, με πρόσβαση μόνο από εξουσιοδοτημένο προσωπικό. Η εφαρμογή μας ακολουθεί τα πρότυπα ασφαλείας της βιομηχανίας για την προστασία των δεδομένων σας.\n" +
                 "\n" +
                 "Επικοινωνήστε Μαζί μας\n" +
                 "Για οποιεσδήποτε ερωτήσεις ή βοήθεια, παρακαλώ επικοινωνήστε με το γραφείο Απολεσθέντων:\n" +
                 "\n" +
                 "Τηλέφωνο: 2103536215\n" +
                 "Email: lostandfound@gmail.com\n" +
                 "Διεύθυνση: Αεροδρόμιο Αθηνών \"Ελευθέριος Βενιζέλος\"");

                txtArea.setPrefWidth(Screen.getPrimary().getVisualBounds().getWidth());
                txtArea.setPrefHeight(Screen.getPrimary().getVisualBounds().getHeight()-20);
                btnClose = new Button("Close");
                vBox = new VBox();
                vBox.setAlignment(Pos.CENTER);
                vBox.getChildren().addAll(txtArea,btnClose);
                scene = new Scene(vBox, 600, 600);
                stage = new Stage();
                stage.setTitle("About");
                stage.setScene(scene);
                txtArea.setWrapText(true);
                txtArea.setEditable(false);

                btnClose.setOnAction(e -> stage.close());

               // vBox.setPadding(new Insets(15, 15, 15, 15));



                stage.show();
    }



}
